#include <iostream>

using namespace std;

void min_sum_distance(){
/**
1. считать 4 числа в червяка
2. число в хвосте червяка  потенциальный минимум из пройденных
3. сдвинуть все числа в червяке влево(123 - 1234)
4. считать птое число в зубы червяку
5. ВЫВЕСТИ ЧЕРВЯКА И ПРОЙДННЫЙ МИНИМУМ ДЛЯ ПРОВЕРКИ
6. собрать пару из того, что в зубах у червяка,и пройденного минимума
7. это кондитат на минимальную пару
8. один ход червяка закончен, повторяем
**/

}
int main()
{
    min_sum_distance();
    return 0;
}
